//===============================================
//
// 仲間クラス全体の管理処理 [ arraymanager.cpp ]
// Author: Asuma Nishio
//
//===============================================

//**********************
// インクルードファイル
//**********************
#include "arraymanager.h"

//===========================
// コンストラクタ
//============================
CArrayManager::CArrayManager() : m_pArrays{}
{

}
//===========================
// デストラクタ
//============================
CArrayManager::~CArrayManager()
{

}
//===========================
// 初期化処理
//============================
HRESULT CArrayManager::Init(void)
{
	// 配列初期化
	m_pArrays.clear();

	return S_OK;
}
//===========================
// 終了処理
//============================
void CArrayManager::Uninit(void)
{
	// 破棄
	m_pArrays.clear();
}
//===========================
// 更新処理
//============================
void CArrayManager::Update(void)
{

}
//===========================
// 描画処理
//============================
void CArrayManager::Draw(void)
{
	// 無し
}