//=========================================================
//
// あらかじめマップに配置されている餌の管理処理 [ basemapfeed.h ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// インクルードファイル
//*********************************************************
#include <array>

//*********************************************************
// 前方宣言
//*********************************************************
class CFeed;

//*********************************************************
// 配置されている餌を管理するクラスを定義
//*********************************************************
class CBaseMapFeed
{
public:

	CBaseMapFeed();
	~CBaseMapFeed();

	HRESULT Init(void);
	void Uninit(void);

	/// <summary>
	/// 配列中の指定番号の餌のポインタを返す
	/// </summary>
	/// <param name="nIdx">取得する配列番号</param>
	/// <returns></returns>
	inline CFeed* GetFeedIdx(const int& nIdx) const { return m_pBaseFeeds[nIdx]; }

private:

	static constexpr int NUM_BASEFEED = 4; // 最大数

	std::array<CFeed*, NUM_BASEFEED>m_pBaseFeeds; // 餌の配列
};