//=============================================
//
// 敵の状態管理基底処理 [ enemystatebase.cpp ]
// Author: Asuma Nishio
//
//=============================================

//**********************
// インクルードファイル
//**********************
#include "enemystatebase.h"

//===============================
// オーバーロードコンストラクタ
//===============================
CEnemyStateBase::CEnemyStateBase()
{
	// 値をクリア
	m_pEnemy = nullptr;
	m_ID = ID_NEUTRAL;
}
//===============================
// デストラクタ
//===============================
CEnemyStateBase::~CEnemyStateBase()
{
	// 無し
}
