//=========================================================
//
// 敵のスポナー処理 [ enemyspawner.cpp ]
// Author: Asuma Nishio
// 
//=========================================================

//*********************************************************
// インクルードファイル
//*********************************************************
#include "enemyspawner.h"
#include "enemy.h"
#include "gamesceneobject.h"
#include "time.h"

//=========================================================
// コンストラクタ
//=========================================================
CEnemySpawner::CEnemySpawner() : m_pEnemy{},m_SpawnInterval(NULL),m_Timer(NULL)
{
	// 値のクリア
}
//=========================================================
// デストラクタ
//=========================================================
CEnemySpawner::~CEnemySpawner()
{
	Uninit();
}
//=========================================================
// 初期化処理
//========================================================
HRESULT CEnemySpawner::Init(void)
{
	// 配列切り離し
	m_pEnemy.clear();

	return S_OK;
}
//=========================================================
// 終了処理
//========================================================
void CEnemySpawner::Uninit(void)
{
	// 配列切り離し
	m_pEnemy.clear();
}
//=========================================================
// 更新処理
//========================================================
void CEnemySpawner::Update(void)
{

}
//=========================================================
// スポーンする場所のセット処理
//========================================================
void CEnemySpawner::SetEnemy(void)
{
#if 0
	// 5体ランダム
	int spawnCount = rand() % 5 + 1;

	for (int i = 0; i < spawnCount; i++)
	{
		// スポーン地点をランダム選択
		int index = rand() % m_SpawnPos.size();

		// 座標
		D3DXVECTOR3 pos = m_SpawnPos[index];
		D3DXVECTOR3 rot = VECTOR3_NULL;

		// 敵生成
		CEnemy* pEnemy = CEnemy::Create(pos, rot, 10);

		// 配列に追加
		m_pEnemy.push_back(pEnemy);
	}
#endif
}