//=============================================
//
// 敵の各種状態管理処理 [ enemystate.h ]
// Author: Asuma Nishio
//
//=============================================

//**********************
// インクルードファイル
//**********************
#include "enemystate.h"

//============================
// コンストラクタ
//============================
CEnemyStateNeutral::CEnemyStateNeutral()
{
	// IDセット
	SetID(ID_NEUTRAL);
}
//============================
// デストラクタ
//============================
CEnemyStateNeutral::~CEnemyStateNeutral()
{

}
//============================
// 開始関数
//============================
void CEnemyStateNeutral::OnStart()
{
	// モーションセット

}
//============================
// 更新関数
//============================
void CEnemyStateNeutral::OnUpdate()
{

}
//============================
// 終了関数
//============================
void CEnemyStateNeutral::OnExit()
{

}