//=========================================================
//
// 敵の複数管理処理 [ enemymanager.cpp ]
// Author: Asuma Nishio
//
// TODO : 出現位置はランダムなスポーン場所に任せる
// 
//=========================================================

//*********************************************************
// インクルードファイル
//*********************************************************
#include "enemymanager.h"
#include "enemy.h"

//=========================================================
// コンストラクタ
//=========================================================
CEnemyManager::CEnemyManager() : m_pEnemys{}
{

}
//=========================================================
// デストラクタ
//=========================================================
CEnemyManager::~CEnemyManager()
{
	Uninit();
}
//=========================================================
// 初期化処理
//=========================================================
HRESULT CEnemyManager::Init(void)
{
	// 配列クリア
	m_pEnemys.clear();

	// 配列のサイズを設定
	m_pEnemys.reserve(Config::NUM_ENEMY);

	// 生成する
	for (auto iter = m_pEnemys.begin(); iter != m_pEnemys.end(); iter++)
	{
		// キャラクター生成
		auto Newenemy = CEnemy::Create(VECTOR3_NULL,VECTOR3_NULL,Config::LIFE);

		// 配列に格納
		m_pEnemys.push_back(Newenemy);
	}

	return S_OK;
}
//=========================================================
// 終了処理
//=========================================================
void CEnemyManager::Uninit(void)
{
	// 配列クリア
	m_pEnemys.clear();
}
//=========================================================
// 更新処理
//=========================================================
void CEnemyManager::Update(void)
{

}