//===============================================
//
// 複数の餌を管理する処理 [ feedmanager.cpp ]
// Author: Asuma Nishio
//
//===============================================

//**********************
// インクルードファイル
//**********************
#include "feedmanager.h"
#include "feed.h"

//===========================
// コンストラクタ
//===========================
CFeedManager::CFeedManager()
{

}
//===========================
// デストラクタ
//===========================
CFeedManager::~CFeedManager()
{

}
//===========================
// 初期化処理
//===========================
HRESULT CFeedManager::Init(void)
{
	return S_OK;
}
//===========================
// 終了処理
//===========================
void CFeedManager::Uninit(void)
{

}
//===========================
// 更新処理
//===========================
void CFeedManager::Update(void)
{

}
//===========================
// 描画処理
//===========================
void CFeedManager::Draw(void)
{

}