//=======================================
//
// 草の一括管理処理 [ grassmanager.cpp ]
// Author: Asuma Nishio
//
//=======================================

//**********************
// インクルードファイル
//**********************
#include "grassmanager.h"

//================================
// コンストラクタ
//================================
CGrassManager::CGrassManager()
{

}
//================================
// デストラクタ
//================================
CGrassManager::~CGrassManager()
{

}
//================================
// 生成処理
//================================
CGrass* CGrassManager::CreateManager(const D3DXVECTOR3 pos)
{
	return nullptr;
}
//================================
// 読み込み処理
//================================
void CGrassManager::Load(void)
{

}
//================================
// 初期化処理
//================================
HRESULT CGrassManager::Init(void)
{
	return S_OK;
}
//================================
// 終了処理
//================================
void CGrassManager::Uninit(void)
{

}
//================================
// 更新処理
//================================
void CGrassManager::Update(void)
{

}
//================================
// 描画処理
//================================
void CGrassManager::Draw(void)
{
}
