//=========================================================
//
// ランキングのオブジェクト管理 [ rankingobject.cpp ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードファイル
//*********************************************************
#include "rankingobject.h"
#include "ui.h"
#include "rankingscore.h"

//*********************************************************
// 静的メンバ変数宣言
//*********************************************************
CRankingObject* CRankingObject::m_pInstance = nullptr; // 1つのインスタンス

//=========================================================
// コンストラクタ
//=========================================================
CRankingObject::CRankingObject()
{
	// 値のクリア
}
//=========================================================
// デストラクタ
//=========================================================
CRankingObject::~CRankingObject()
{

}
//=========================================================
// 初期化処理
//=========================================================
HRESULT CRankingObject::Init(void)
{// 各種オブジェクトの生成
	
	// ui
	CUi::Create(D3DXVECTOR3(640.0f, 360.0f, 0.0f), 30, 640.0f, 360.0f, "RankBack.jpg", false);

	// ランキングスコア生成
	CRankingScore::Create(D3DXVECTOR3(850.0f, 190.0f, 0.0f), 250.0f, 40.0f);

	return S_OK;
}
//=========================================================
// 終了処理
//=========================================================
void CRankingObject::Uninit(void)
{
	// インスタンスの破棄
	if (m_pInstance)
	{
		delete m_pInstance;
		m_pInstance = nullptr;
	}
}
//=========================================================
// 更新処理
//=========================================================
void CRankingObject::Update(void)
{

}
//=========================================================
// 描画処理
//=========================================================
void CRankingObject::Draw(void)
{

}
//=========================================================
// インスタンス取得処理
//=========================================================
CRankingObject* CRankingObject::GetInstance(void)
{
	// nullなら
	if (m_pInstance == nullptr)
	{
		m_pInstance = new CRankingObject;
	}

	// 生成されたインスタンスを返す
	return m_pInstance;
}
