//=========================================================
//
// ランキングのオブジェクト管理 [ rankingobject.h ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// インクルードファイル
//*********************************************************
#include <memory>

//*********************************************************
// 前方宣言
//*********************************************************

//*********************************************************
// ランキングで使うオブジェクトを管理するクラスを定義
//*********************************************************
class CRankingObject
{
public:

	~CRankingObject();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	static CRankingObject* GetInstance(void);

private:

	CRankingObject(); // コンストラクタ

	static CRankingObject* m_pInstance; // シングルトン変数
};

