//=========================================================
//
// リザルトのオブジェクト管理 [ resultobject.h ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// インクルードファイル
//*********************************************************
#include <memory>

//*********************************************************
// 前方宣言
//*********************************************************

//*********************************************************
// リザルトで使うオブジェクトを管理するクラスを定義
//*********************************************************
class CResultObject
{
public:

	~CResultObject();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	static CResultObject* GetInstance(void);

private:

	CResultObject(); // コンストラクタ

	static CResultObject* m_pInstance; // シングルトン変数

};