//=========================================================
//
// リザルトのオブジェクト管理 [ resultobject.cpp ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードファイル
//*********************************************************
#include "resultobject.h"
#include "ui.h"
#include "resultscore.h"
#include "meshfield.h"
#include "queen.h"
#include "meshdome.h"

//*********************************************************
// 静的メンバ変数宣言
//*********************************************************
CResultObject* CResultObject::m_pInstance = nullptr; // 1つのインスタンス

//=========================================================
// コンストラクタ
//=========================================================
CResultObject::CResultObject()
{
	// 値のクリア
}
//=========================================================
// デストラクタ
//=========================================================
CResultObject::~CResultObject()
{

}
//=========================================================
// 初期化処理
//=========================================================
HRESULT CResultObject::Init(void)
{// 各種オブジェクト生成

	CQueen::Create(D3DXVECTOR3(0.0f, 30.0f, -5.0f), VECTOR3_NULL);

	// メッシュドーム生成
	CMeshDome::Create(D3DXVECTOR3(0.0f, -20.0f, 0.0f), 60.0f);

	// UI
	CUi::Create(D3DXVECTOR3(640.0f, 75.0f, 0.0f), 30, 200.0f, 55.0f, "result_logo.png", false);

	// メッシュフィールド生成
	CMeshField::Create(VECTOR3_NULL, 3200.0f, 2000.0f, 1, 1);

	// リザルト表示スコア
	CResultScore::Create(D3DXVECTOR3(960.0f, 400.0f, 0.0f), 40.0f, 80.0f);

	return S_OK;
}
//=========================================================
// 終了処理
//=========================================================
void CResultObject::Uninit(void)
{
	// インスタンスの破棄
	if (m_pInstance)
	{
		delete m_pInstance;
		m_pInstance = nullptr;
	}
}
//=========================================================
// 更新処理
//=========================================================
void CResultObject::Update(void)
{

}
//=========================================================
// 描画処理
//=========================================================
void CResultObject::Draw(void)
{

}
//=========================================================
// インスタンス取得処理
//=========================================================
CResultObject* CResultObject::GetInstance(void)
{
	// nullなら生成
	if (m_pInstance == nullptr)
	{
		m_pInstance = new CResultObject;
	}

	// インスタンスを返す
	return m_pInstance;
}