//=========================================================
//
// リザルトシーン処理 [ result.cpp ]
// Author: Asuma Nishio
// 
//=========================================================

//*********************************************************
// インクルードファイル宣言
//*********************************************************
#include "result.h"
#include "resultmanager.h"
#include "manager.h"
#include "ranking.h"
#include "input.h"
#include "fade.h"
#include "resultobject.h"

//=========================================================
// オーバーロードコンストラクタ
//=========================================================
CResult::CResult() : CScene(CScene::MODE_RESULT)
{

}
//=========================================================
// デストラクタ
//=========================================================
CResult::~CResult()
{
	// 無し
}
//=========================================================
// 初期化処理
//=========================================================
HRESULT CResult::Init(void)
{
	// オブジェクト初期化
	CResultObject::GetInstance()->Init();

	// 初期化結果を返す
	return S_OK;
}
//=========================================================
// 終了処理
//=========================================================
void CResult::Uninit(void)
{
	// インスタンス破棄
	CResultObject::GetInstance()->Uninit();
}
//=========================================================
// 更新処理
//=========================================================
void CResult::Update(void)
{
	// オブジェクト更新
	CResultObject::GetInstance()->Update();

	// 画面遷移する
	if (CManager::GetInstance()->GetInputKeyboard()->GetTrigger(DIK_RETURN))
	{
		// 画面遷移
		auto fade = CManager::GetInstance()->GetFade();
		fade->SetFade(std::make_unique<CRanking>());
		return;
	}
}
//=========================================================
// 描画処理
//=========================================================
void CResult::Draw(void)
{
	// 無し
}