//=========================================================
//
// リザルトシーン処理 [ result.cpp ]
// Author: Asuma Nishio
// 
//=========================================================

//*********************************************************
// インクルードファイル宣言
//*********************************************************
#include "result.h"
#include "resultmanager.h"
#include "ui.h"
#include "manager.h"
#include "ranking.h"
#include "input.h"
#include "fade.h"
#include "resultscore.h"

//=========================================================
// オーバーロードコンストラクタ
//=========================================================
CResult::CResult() : CScene(CScene::MODE_RESULT)
{

}
//=========================================================
// デストラクタ
//=========================================================
CResult::~CResult()
{
	// 無し
}
//=========================================================
// 初期化処理
//=========================================================
HRESULT CResult::Init(void)
{
	// 仮背景生成 検証結果 : ok
	CUi::Create(D3DXVECTOR3(640.0f, 360.0f, 0.0f), 30, 1280.0f, 720.0f, "result.jpg", false);

	// スコア確認 検証結果 : ok
	CResultScore::Create(D3DXVECTOR3(960.0f, 400.0f, 0.0f), 40.0f, 80.0f);

	// 初期化結果を返す
	return S_OK;
}
//=========================================================
// 終了処理
//=========================================================
void CResult::Uninit(void)
{

}
//=========================================================
// 更新処理
//=========================================================
void CResult::Update(void)
{
#ifdef _DEBUG

	// 画面遷移
	if (CManager::GetInstance()->GetInputKeyboard()->GetTrigger(DIK_SPACE))
	{
		// 画面遷移
		auto fade = CManager::GetInstance()->GetFade();
		fade->SetFade(std::make_unique<CRanking>());
		return;
	}

#endif // _DEBUG


}
//=========================================================
// 描画処理
//=========================================================
void CResult::Draw(void)
{
	// 無し
}
