//=============================================================================
//
// 各シーンごとに使うManagerクラスを一括管理する処理 [ scenemanagement.cpp ]
// Author: Asuma Nishio
//
//=============================================================================

//**********************
// インクルードファイル
//**********************
#include "scenemanagement.h"

//==================================
// コンストラクタ
//==================================
CSceneManagement::CSceneManagement()
{

}
//==================================
// デストラクタ
//==================================
CSceneManagement::~CSceneManagement()
{

}
