//===========================================================================================
//
// 各シーンごとで出現するObjectManagerクラスを一括管理する処理 [ sceneobjectmanagement.cpp ]
// Author: Asuma Nishio
//
//===========================================================================================

//**********************
// インクルードファイル
//**********************
#include "sceneobjectmanagement.h"

//=======================================
// コンストラクタ
//=======================================
CSceneObjectManagement::CSceneObjectManagement()
{

}
//=======================================
// デストラクタ
//=======================================
CSceneObjectManagement::~CSceneObjectManagement()
{

}