//=========================================================
//
// タイトル管理処理 [ titlemanager.h ]
// Author: Asuma Nishio
// 
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once 

//*********************************************************
// 前方宣言
//*********************************************************
class CUi;

//*********************************************************
// インクルードファイル
//*********************************************************
#include <memory>

//*********************************************************
// タイトルマネージャー管理クラスを定義
//*********************************************************
class CTitleManager
{
public:

	~CTitleManager();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	static CTitleManager* GetInstance(void);

private:

	CTitleManager();

	CUi* m_pUi;				// クラスポインタ
	int m_nIdx;				// 選択番号
};