//=========================================================
//
// タイトルのキャラクター処理 [ titleant.cpp ]
// Author: Asuma Nishio
//
// 簡易的な移動ロジックを組む
// 
//=========================================================

//*********************************************************
// インクルードファイル
//*********************************************************
#include "titleant.h"

//=========================================================
// コンストラクタ
//=========================================================
CTitleAnt::CTitleAnt(int nPriority) : CMoveCharactor(nPriority)
{

}
//=========================================================
// デストラクタ
//=========================================================
CTitleAnt::~CTitleAnt()
{

}
//=========================================================
// 生成処理
//=========================================================
CTitleAnt* CTitleAnt::Create(const D3DXVECTOR3& pos, const D3DXVECTOR3& rot)
{
	// インスタンス生成
	CTitleAnt * pAnt = new CTitleAnt;
	if (pAnt == nullptr) return nullptr;

	// オブジェクト設定
	pAnt->SetPos(pos);
	pAnt->SetRot(rot);
	pAnt->SetUseStencil(false);

	// 初期化失敗時
	if (pAnt->Init()) return nullptr;

	return pAnt;
}
//=========================================================
// 初期化処理
//=========================================================
HRESULT CTitleAnt::Init(void)
{
	// 親クラスの初期化
	CMoveCharactor::Init();

	// モーションセット
	MotionLoad("data/MOTION/Array/Title_Array.txt",MOTION_MAX,false);

	return S_OK;
}
//=========================================================
// 終了処理
//=========================================================
void CTitleAnt::Uninit(void)
{
	// 親クラスの終了
	CMoveCharactor::Uninit();
}
//=========================================================
// 更新処理
//=========================================================
void CTitleAnt::Update(void)
{
	// 親クラスの終了
	CMoveCharactor::Update();
}
//=========================================================
// 描画処理
//=========================================================
void CTitleAnt::Draw(void)
{
	// 親クラスの描画
	CMoveCharactor::Draw();
}