//=======================================================
//
// タイトルで出現するオブジェクト処理 [ titleobject.cpp ]
// Author: Asuma Nishio
//
//=======================================================

//**********************
// インクルードファイル
//**********************
#include "titleobject.h"

//=============================
// コンストラクタ
//=============================
CTitleObject::CTitleObject()
{
	// 値のクリア
}
//=============================
// デストラクタ
//=============================
CTitleObject::~CTitleObject()
{
	Uninit();
}
//=============================
// 初期化処理
//=============================
HRESULT CTitleObject::Init(void)
{
	return S_OK;
}
//=============================
// 終了処理
//=============================
void CTitleObject::Uninit(void)
{
	// 無し
}
//=============================
// 更新処理
//=============================
void CTitleObject::Update(void)
{
	// メンバの更新
}
//=============================
// 描画処理
//=============================
void CTitleObject::Draw(void)
{

}