//=========================================================
//
// タイトルのキャラクター処理 [ titleant.h ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// インクルードファイル
//*********************************************************
#include "movecharactor.h"
#include <memory>

//*********************************************************
// 前方宣言
//*********************************************************

//*********************************************************
// タイトルのアリのクラスを定義
//*********************************************************
class CTitleAnt : public CMoveCharactor
{
public:

	CTitleAnt(int nPriority = static_cast<int>(CObject::PRIORITY::CHARACTOR));
	~CTitleAnt();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	static CTitleAnt* Create(const D3DXVECTOR3& pos, const D3DXVECTOR3& rot);

private:
};