//=========================================================
//
// チュートリアル管理処理 [ tutorialmanager.cpp ]
// Author: Asuma Nishio
//
//=========================================================

//********************************************************
// インクルードファイル
//********************************************************
#include "tutorialmanager.h"
#include "tutorialui.h"
#include "manager.h"
#include "fade.h"
#include "game.h"
#include "ui.h"
#include "meshfield.h"
#include "meshdome.h"

//=========================================================
// インスタンス取得
//=========================================================
CTutorialManager* CTutorialManager::GetInstance(void)
{
	// 生成されたインスタンス
	static CTutorialManager pTutoManager;
	return &pTutoManager;
}
//=========================================================
// コンストラクタ
//=========================================================
CTutorialManager::CTutorialManager()
{
	// 値のクリア
}
//=========================================================
// デストラクタ
//=========================================================
CTutorialManager::~CTutorialManager()
{
	// 無し
}
//=========================================================
// 初期化処理
//=========================================================
HRESULT CTutorialManager::Init(void)
{
	// メッシュフィールド生成
	CMeshField::Create(VECTOR3_NULL, 3200.0f, 2000.0f, 1, 1);

	// メッシュドーム生成
	CMeshDome::Create(D3DXVECTOR3(0.0f, -20.0f, 0.0f), 60.0f);

	// 初期化結果を返す
	return S_OK;
}
//=========================================================
// 終了処理
//=========================================================
void CTutorialManager::Uninit(void)
{
	// 破棄
}
//=========================================================
// 更新処理
//=========================================================
void CTutorialManager::Update(void)
{

}
//=========================================================
// 描画処理
//=========================================================
void CTutorialManager::Draw(void)
{

}