//=========================================================
//
// アリで出すUIの複数管理処理 [ workeruimanager.h ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードファイル
//*********************************************************
#include "workeruimanager.h"
#include "workerui.h"

//*********************************************************
// 定数宣言
//*********************************************************
namespace WorkUi
{
	const D3DXVECTOR3 Bacepos = D3DXVECTOR3(450.0f, 120.0f, 0.0f); // 基準座標
	constexpr float WIDTH = 70.0f;								   // 横幅
	constexpr float HEIGHT = 70.0f;								   // 高さ
}

//=========================================================
// コンストラクタ
//=========================================================
CWorkerUiManager::CWorkerUiManager()
{
	// 値のクリア
	for (auto worker : m_pWorkUi)
	{
		worker = nullptr;
	}
}
//=========================================================
// デストラクタ
//=========================================================
CWorkerUiManager::~CWorkerUiManager()
{

}
//=========================================================
// 初期化処理
//=========================================================
HRESULT CWorkerUiManager::Init(void)
{
	// 名前空間
	using namespace WorkUi;

	for (int nCnt = 0; nCnt < NUM_UI; nCnt++)
	{
		// 基準座標セット
		D3DXVECTOR3 pos = Bacepos;

		// 横幅を空ける
		pos.x += nCnt * SPACE_WIDTH;

		// UIを配置する
		m_pWorkUi[nCnt] = CWorkerUi::Create(pos, WIDTH, HEIGHT);
	}

	return S_OK;
}
//=========================================================
// 終了処理
//=========================================================
void CWorkerUiManager::Uninit(void)
{

}
//=========================================================
// 更新処理
//=========================================================
void CWorkerUiManager::Update(void)
{

}