//=========================================================
//
// 働きアリの複数管理処理 [ workermanager.cpp ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードファイル
//*********************************************************
#include "workermanager.h"
#include "worker.h"

//=========================================================
// コンストラクタ
//=========================================================
CWorkerManager::CWorkerManager() : m_pWorker{}
{

}
//=========================================================
// デストラクタ
//=========================================================
CWorkerManager::~CWorkerManager()
{
	// 終了処理
	Uninit();
}
//=========================================================
// 初期化処理
//=========================================================
HRESULT CWorkerManager::Init(void)
{
	// 配列のクリア
	m_pWorker.clear();

	// 構造体変数を使用
	Config config = {};

	// 生成するサイズのメモリをあらかじめ確保する
	m_pWorker.reserve(config.NUM_WOKER);

	// 動的ポインタを生成
	for (int nCnt = 0; nCnt < config.NUM_WOKER; nCnt++)
	{
		// nCntごとに右へ動かして並べる
		float x = config.WORKER_INTERVAL * nCnt;

		auto pArray = CWorker::Create(D3DXVECTOR3(x, 0.0f, 0.0f), VECTOR3_NULL);

		// 配列に追加
		m_pWorker.push_back(pArray);
	}

	return S_OK;
}
//=========================================================
// 終了処理
//=========================================================
void CWorkerManager::Uninit(void)
{
	// 配列クリア
	m_pWorker.clear();
}
//=========================================================
// 更新処理
//=========================================================
void CWorkerManager::Update(void)
{

}