//===================================================================
//
// 命令分岐をする判断ノードクラス [ arrayusetoporder.cpp ]
// Author: Asuma Nishio
//
//===================================================================

//*******************************************************************
// クラス定義ヘッダーファイル
//*******************************************************************
#include "arrayusetoporder.h"

//===================================================================
// コンストラクタ
//===================================================================
CArrayUseTopOrder::CArrayUseTopOrder(CBlackBoard* blackboard, CNode* TrueNode, CNode* FalseNode) :
	CBranchNodeBase(blackboard, TrueNode, FalseNode)
{

}
//===================================================================
// 判別結果を返す処理
//===================================================================
const bool CArrayUseTopOrder::IsCondition()
{
	// 命令を受けているか判別する
	return m_pBlackBoard->GetValue<bool>("GetTopOrder");
}