//===================================================================
//
// 敵を攻撃する末端ノード処理 [ attackenemyleaf.cpp ]
// Author: Asuma Nishio
//
//===================================================================

//*******************************************************************
// クラス定義ヘッダーファイル
//*******************************************************************
#include "attackenemyleaf.h"

//*******************************************************************
// インクルードファイル
//*******************************************************************
#include "array.h"

//===================================================================
// 更新処理
//===================================================================
void CAttackEnemyLeaf::Update(void)
{
	// アリを取得
	const auto& Array = m_pBlackBoard->GetValue<CArray*>("Array");

	// フラグ格納変数
	bool IsAttack = false;

	// キー情報が見つかったら
	if (m_pBlackBoard->HasKeyData("AttackMode"))
	{
		// 判別フラグを取得
		IsAttack = m_pBlackBoard->GetValue<bool>("AttackMode");
	}

	// コリジョン関数実行
	if (IsAttack) Array->CollisionEnemy();
}