//=========================================================
//
// 敵のスポナー処理 [ enemyspawner.cpp ]
// Author: Asuma Nishio
// 
//=========================================================

//*********************************************************
// クラス定義ヘッダーファイル
//*********************************************************
#include "enemyspawner.h"

//*********************************************************
// インクルードファイル
//*********************************************************
#include "enemy.h"
#include "gamesceneobject.h"
#include "gametime.h"

//=========================================================
// コンストラクタ
//=========================================================
CEnemySpawner::CEnemySpawner() : m_Activepos(VECTOR3_NULL)
{
	
}
//=========================================================
// デストラクタ
//=========================================================
CEnemySpawner::~CEnemySpawner()
{
	Uninit();
}
//=========================================================
// 生成処理
//========================================================
CEnemySpawner* CEnemySpawner::Create(const D3DXVECTOR3& Activepos)
{
	// インスタンス生成
	CEnemySpawner* pSpawn = new CEnemySpawner;
	if (pSpawn == nullptr) return nullptr;

	// 座標の設定
	pSpawn->SetPos(Activepos);

	// 初期化失敗時
	if (pSpawn->Init()) return nullptr;

	return pSpawn;
}
//=========================================================
// 初期化処理
//========================================================
HRESULT CEnemySpawner::Init(void)
{
	return S_OK;
}
//=========================================================
// 終了処理
//========================================================
void CEnemySpawner::Uninit(void)
{

}