//===================================================================
//
// トップアリを追従する末端ノード処理 [ followtopleaf.cpp ]
// Author: Asuma Nishio
//
//===================================================================

//*******************************************************************
// クラス定義ヘッダーファイル
//*******************************************************************
#include "followtopleaf.h"

//*******************************************************************
// インクルードファイル
//*******************************************************************
#include "array.h"

//===================================================================
// トップを追従する末端ノードの更新処理
//===================================================================
void CFollowTopLeaf::Update(void)
{
	// アリを取得
	const auto& Array = m_pBlackBoard->GetValue<CArray*>("Array");

	// ステートが [ASSAULT] になっていたら次のステップに移行する
	if (Array->GetState() == CArray::ARRAY_STATE::ASSAULT)
	{
		m_Result = NodeInfo::NodeResult::Re_SUCCESS;
		return;
	}

	// 追従する関数を実行する
	Array->FollowTop(m_pBlackBoard->GetValue<D3DXVECTOR3>("TopPos"));
	m_Result = NodeInfo::NodeResult::Re_RUNING; // 処理を継続
}