//=========================================================
// 
// タイトルui処理 [ titleui.cpp ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードファイル
//*********************************************************
#include "titleui.h"
#include "texture.h"
#include "manager.h"

//=========================================================
// コンストラクタ
//=========================================================
CTitleUi::CTitleUi(int nPriority) : CObject2D(nPriority)
{
	// 値のクリア
}
//=========================================================
// デストラクタ
//=========================================================
CTitleUi::~CTitleUi()
{
	// 無い
}
//=========================================================
// 初期化処理
//=========================================================
HRESULT CTitleUi::Init(void)
{
	// 2Dオブジェクトの初期化処理
	CObject2D::Init();

	// 初期化結果を返す
	return S_OK;
}
//=========================================================
// 終了処理
//=========================================================
void CTitleUi::Uninit(void)
{
	// 2Dオブジェクトの終了処理
	CObject2D::Uninit();
}
//=========================================================
// 更新処理
//=========================================================
void CTitleUi::Update(void)
{
	// 2Dオブジェクトの更新処理
	CObject2D::Update();
}
//=========================================================
// 描画処理
//=========================================================
void CTitleUi::Draw(void)
{
	// 2Dオブジェクトの描画処理
	CObject2D::Draw();
}
//=========================================================
// 生成処理
//=========================================================
CTitleUi* CTitleUi::Create
(
	const D3DXVECTOR3& pos, 
	const D3DXCOLOR& col, 
	const float& fWidth, 
	const float& fHeight,
	const char * pTexName
)
{
	// インスタンス生成
	CTitleUi* pTitleui = new CTitleUi;
	if (pTitleui == nullptr) return nullptr;

	// 初期化失敗時
	if (FAILED(pTitleui->Init())) return nullptr;

	// 2Dオブジェクト設定
	pTitleui->SetPos(pos);
	pTitleui->SetCol(col);
	pTitleui->SetSize(fWidth, fHeight);
	pTitleui->SetTexture(pTexName);

	// 生成されたポインタを返す
	return pTitleui;
}