//=========================================================
//
// チュートリアル処理 [ tutorial.cpp ]
// Author: Asuma Nishio
// 
//=========================================================

//*********************************************************
// インクルードファイル
//*********************************************************
#include "tutorial.h"
#include "tutorialmanager.h"
#include "tutorialobject.h"

//=========================================================
// オーバーロードコンストラクタ
//=========================================================
CTutorial::CTutorial() : CScene(CScene::MODE_TUTORIAL)
{
	
}
//=========================================================
// デストラクタ
//=========================================================
CTutorial::~CTutorial()
{
	
}
//=========================================================
// 初期化処理
//=========================================================
HRESULT CTutorial::Init(void)
{	
	// チュートリアルマネージャー初期化
	CTutorialManager::GetInstance()->Init();

	// チュートリアルオブジェクト初期化
	CTutorialObject::GetInstance()->Init();

	// 初期化結果を返す
	return S_OK;
}
//=========================================================
// 終了処理
//=========================================================
void CTutorial::Uninit(void)
{
	// チュートリアルマネージャー終了
	CTutorialManager::GetInstance()->Uninit();

	// チュートリアルオブジェクト終了
	CTutorialObject::GetInstance()->Uninit();
}
//=========================================================
// 更新処理
//=========================================================
void CTutorial::Update(void)
{
	// チュートリアルマネージャー更新
	CTutorialManager::GetInstance()->Update();
}
//=========================================================
// 描画処理
//=========================================================
void CTutorial::Draw(void)
{
	
}