//===================================================================
//
// 命令分岐をする判断ノードクラス [ arrayusetoporder.h ]
// Author: Asuma Nishio
//
//===================================================================

//*******************************************************************
// インクルードガード
//*******************************************************************
#pragma once

//*******************************************************************
// インクルードファイル
//*******************************************************************
#include "branchnodebase.h"

//*******************************************************************
//命令分岐をする判断ノードのクラスを定義
//*******************************************************************
class CArrayUseTopOrder : public CBranchNodeBase
{
public:

	CArrayUseTopOrder(CBlackBoard* blackboard,CNode * TrueNode,CNode * FalseNode);
	~CArrayUseTopOrder() = default;

private:

	const bool IsCondition() override;	// 判別関数
};