//=========================================================
//
// 敵のスポナー処理 [ enemyspawner.h ]
// Author: Asuma Nishio
// 
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// インクルードファイル
//*********************************************************
#include <memory>
#include <vector>

//*********************************************************
// 前方宣言
//*********************************************************
class CEnemy;

//*********************************************************
// 敵の出現するスポナー1個に対するクラスを定義
//*********************************************************
class CEnemySpawner
{
public:

	CEnemySpawner();
	~CEnemySpawner();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);

	inline void SetPos(const D3DXVECTOR3& pos) { m_Activepos = pos; }

private:

	D3DXVECTOR3 m_Activepos;	// 出現座標
};