//=========================================================
//
// jsonファイル読み込み管理処理 [ jsonmanager.h ]
// Author: Asuma Nishio
// 
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once 

//*********************************************************
// インクルードファイル
//*********************************************************
#include <string>
#include <vector>

//*********************************************************
// jsonを一括管理するクラスを定義
//*********************************************************
class CJsonManager
{
public:

	CJsonManager();
	~CJsonManager();

	HRESULT Load(const char* LoadFileName);

private:

	std::vector<std::string>TagName; // 読み込んだタグ名
};