//===================================================================
//
// トップからの命令を受け餌を取る末端ノード [ topordertomoveleaf.h ]
// Author: Asuma Nishio
//
//===================================================================

//*******************************************************************
// インクルードガード
//*******************************************************************
#pragma once

//*******************************************************************
// インクルードガード
//*******************************************************************
#pragma once

//*******************************************************************
// インクルードファイル
//*******************************************************************
#include "leafnodebase.h"

//*******************************************************************
// 餌を取得しにいく末端ノードを定義
//*******************************************************************
class CTopOrderToMoveLeaf : public CLeafNodeBase
{
public:

	CTopOrderToMoveLeaf(CBlackBoard* blackboard) : CLeafNodeBase(blackboard), m_Result(NodeInfo::NodeResult::Re_RUNING) {};
	~CTopOrderToMoveLeaf() = default;

	void Update(void);

	NodeInfo::NodeResult get_node_result() const override
	{
		return m_Result;
	};

private:
	NodeInfo::NodeResult m_Result; // 判別フラグ
}; 