//===================================================================
//
// 分断キーのチュートリアルui状態処理 [ tutorialstatesepalation.h ]
// Author: Asuma Nishio
//
//===================================================================

//*******************************************************************
// インクルードガード
//*******************************************************************
#pragma once

//*******************************************************************
// インクルードファイル
//*******************************************************************
#include "tutorialstatebase.h"

//*******************************************************************
// 分断キー入力状態クラスを定義
//*******************************************************************
class CTutorialStateSepalation : public CTutorialStateBase
{
public:
	CTutorialStateSepalation() = default;
	~CTutorialStateSepalation() = default;

	bool OnCheck(void) override;
	void OnStart(void) {};
	void OnExit(void) {};
};