//===================================================================
//
// チュートリアルのステートマシン基底処理 [ tutorialstatebase.h ]
// Author: Asuma Nishio
//
//===================================================================

//*******************************************************************
// インクルードガード
//*******************************************************************
#pragma once

//*******************************************************************
// ステート基底クラスを定義
//*******************************************************************
class CTutorialStateBase
{
public:

	CTutorialStateBase() = default;
	virtual ~CTutorialStateBase() = default;

	virtual bool OnCheck(void) = 0;
	virtual void OnStart(void) {};
	virtual void OnExit(void) {};
};