//===================================================================
//
// 餌命令キーのチュートリアルui状態処理 [ tutorialstatefeedorder.h ]
// Author: Asuma Nishio
//
//===================================================================

//*******************************************************************
// インクルードガード
//*******************************************************************
#pragma once

//*******************************************************************
// インクルードファイル
//*******************************************************************
#include "tutorialstatebase.h"

//*******************************************************************
// 餌命令キー入力状態クラスを定義
//*******************************************************************
class CTutorialStateFeedOrder : public CTutorialStateBase
{
public:

	CTutorialStateFeedOrder() = default;
	~CTutorialStateFeedOrder() = default;

	bool OnCheck(void) override;
	void OnStart(void) {};
	void OnExit(void) {};
};