//===================================================================
//
// 移動キーのチュートリアルui状態処理 [ tutorialstatemove.h ]
// Author: Asuma Nishio
//
//===================================================================

//*******************************************************************
// インクルードガード
//*******************************************************************
#pragma once

//*******************************************************************
// インクルードファイル
//*******************************************************************
#include "tutorialstatebase.h"

//*******************************************************************
// 移動キー入力状態クラスを定義
//*******************************************************************
class CTutorialStateMove : public CTutorialStateBase
{
public:

	CTutorialStateMove() = default;
	~CTutorialStateMove() = default;

	bool OnCheck(void) override;
	void OnStart(void) {};
	void OnExit(void) {};
};